#+TITLE: Quicksort
#+AUTHOR: Cristian Del Gobbo (pledged)
#+SUBTITLE: CSC 240 - Data Structures with C++ - Lyon College, Fall'24
#+STARTUP: overview hideblocks indent
#+PROPERTY: header-args:C :main yes :includes <stdio.h> :results output


* Quicksort Algorithm
#+begin_src C 
  #define N 10

  // Swapping two elements in an array
  void swap(int* a, int* b){
    int temp = (*a);
    (*a) = (*b);
    (*b) = temp;
  }

  int main(){
    int a[2] = {1,2};

    swap(&a[0], &a[1]);
    for(int i = 0; i<2; i++){
      printf("%d ", a[i]);
    }
    return 0;
  }
    #+end_src

#+RESULTS:
: 2 1

#+begin_src C
  // Finding the partitioning element
  int split(int a[], int low, int high){
    int part_element = a[low];
    while(low < high){
      while(low < high && a[high] >= part_element)
        high--;
      a[low] = a[high];
      while(low < high && a[low] <= part_element)
        low++;
      a[high] = a[low];
    }
    a[low] = part_element;
    return low;
  }

  int main(){
    int a[] = {9, 16, 47, 82, 4, 66, 12, 3, 25, 51};

    int n = sizeof(a)/sizeof(a[0]);

    int pivot_index = split(a, 0, n-1);
    printf("Pivot is at index %d\n", pivot_index);
    printf("Array after partitioning: ");
    for(int i = 0; i<n; i++){
      printf("%d ", a[i]);
    }
  }
#+end_src

#+RESULTS:
: Pivot is at index 2
: Array after partitioning: 3 4 9 82 47 66 12 16 25 51

#+begin_src C 
  // Recursive version without split
  void quicksort(int a[], int low, int high){
    if(low >= high) return; // base case
    printf("Recursevely sorting range [%d, %d]\n", low, high);

    // In a complete quicksort, you would partition here & sort parts
    quicksort(a, low, high-1); // Recurse on the first part
    quicksort(a, low+1, high); // Recusrse on the second part
  }

  int main(){
    int a[] = {9, 16, 47, 82, 4, 66, 12, 3, 25, 51};
    int n = sizeof(a)/sizeof(a[0]);

    quicksort(a, 0, n-1);
    return 0;
  }



#+end_src

#+RESULTS:
#+begin_example
Recursevely sorting range [0, 9]
Recursevely sorting range [0, 8]
Recursevely sorting range [0, 7]
Recursevely sorting range [0, 6]
Recursevely sorting range [0, 5]
Recursevely sorting range [0, 4]
Recursevely sorting range [0, 3]
Recursevely sorting range [0, 2]
Recursevely sorting range [0, 1]
Recursevely sorting range [1, 2]
Recursevely sorting range [1, 3]
Recursevely sorting range [1, 2]
Recursevely sorting range [2, 3]
Recursevely sorting range [1, 4]
Recursevely sorting range [1, 3]
Recursevely sorting range [1, 2]
Recursevely sorting range [2, 3]
Recursevely sorting range [2, 4]
Recursevely sorting range [2, 3]
Recursevely sorting range [3, 4]
Recursevely sorting range [1, 5]
Recursevely sorting range [1, 4]
Recursevely sorting range [1, 3]
Recursevely sorting range [1, 2]
Recursevely sorting range [2, 3]
Recursevely sorting range [2, 4]
Recursevely sorting range [2, 3]
Recursevely sorting range [3, 4]
Recursevely sorting range [2, 5]
Recursevely sorting range [2, 4]
Recursevely sorting range [2, 3]
Recursevely sorting range [3, 4]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [1, 6]
Recursevely sorting range [1, 5]
Recursevely sorting range [1, 4]
Recursevely sorting range [1, 3]
Recursevely sorting range [1, 2]
Recursevely sorting range [2, 3]
Recursevely sorting range [2, 4]
Recursevely sorting range [2, 3]
Recursevely sorting range [3, 4]
Recursevely sorting range [2, 5]
Recursevely sorting range [2, 4]
Recursevely sorting range [2, 3]
Recursevely sorting range [3, 4]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [2, 6]
Recursevely sorting range [2, 5]
Recursevely sorting range [2, 4]
Recursevely sorting range [2, 3]
Recursevely sorting range [3, 4]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [3, 6]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [1, 7]
Recursevely sorting range [1, 6]
Recursevely sorting range [1, 5]
Recursevely sorting range [1, 4]
Recursevely sorting range [1, 3]
Recursevely sorting range [1, 2]
Recursevely sorting range [2, 3]
Recursevely sorting range [2, 4]
Recursevely sorting range [2, 3]
Recursevely sorting range [3, 4]
Recursevely sorting range [2, 5]
Recursevely sorting range [2, 4]
Recursevely sorting range [2, 3]
Recursevely sorting range [3, 4]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [2, 6]
Recursevely sorting range [2, 5]
Recursevely sorting range [2, 4]
Recursevely sorting range [2, 3]
Recursevely sorting range [3, 4]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [3, 6]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [2, 7]
Recursevely sorting range [2, 6]
Recursevely sorting range [2, 5]
Recursevely sorting range [2, 4]
Recursevely sorting range [2, 3]
Recursevely sorting range [3, 4]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [3, 6]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [3, 7]
Recursevely sorting range [3, 6]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [4, 7]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [5, 7]
Recursevely sorting range [5, 6]
Recursevely sorting range [6, 7]
Recursevely sorting range [1, 8]
Recursevely sorting range [1, 7]
Recursevely sorting range [1, 6]
Recursevely sorting range [1, 5]
Recursevely sorting range [1, 4]
Recursevely sorting range [1, 3]
Recursevely sorting range [1, 2]
Recursevely sorting range [2, 3]
Recursevely sorting range [2, 4]
Recursevely sorting range [2, 3]
Recursevely sorting range [3, 4]
Recursevely sorting range [2, 5]
Recursevely sorting range [2, 4]
Recursevely sorting range [2, 3]
Recursevely sorting range [3, 4]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [2, 6]
Recursevely sorting range [2, 5]
Recursevely sorting range [2, 4]
Recursevely sorting range [2, 3]
Recursevely sorting range [3, 4]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [3, 6]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [2, 7]
Recursevely sorting range [2, 6]
Recursevely sorting range [2, 5]
Recursevely sorting range [2, 4]
Recursevely sorting range [2, 3]
Recursevely sorting range [3, 4]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [3, 6]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [3, 7]
Recursevely sorting range [3, 6]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [4, 7]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [5, 7]
Recursevely sorting range [5, 6]
Recursevely sorting range [6, 7]
Recursevely sorting range [2, 8]
Recursevely sorting range [2, 7]
Recursevely sorting range [2, 6]
Recursevely sorting range [2, 5]
Recursevely sorting range [2, 4]
Recursevely sorting range [2, 3]
Recursevely sorting range [3, 4]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [3, 6]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [3, 7]
Recursevely sorting range [3, 6]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [4, 7]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [5, 7]
Recursevely sorting range [5, 6]
Recursevely sorting range [6, 7]
Recursevely sorting range [3, 8]
Recursevely sorting range [3, 7]
Recursevely sorting range [3, 6]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [4, 7]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [5, 7]
Recursevely sorting range [5, 6]
Recursevely sorting range [6, 7]
Recursevely sorting range [4, 8]
Recursevely sorting range [4, 7]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [5, 7]
Recursevely sorting range [5, 6]
Recursevely sorting range [6, 7]
Recursevely sorting range [5, 8]
Recursevely sorting range [5, 7]
Recursevely sorting range [5, 6]
Recursevely sorting range [6, 7]
Recursevely sorting range [6, 8]
Recursevely sorting range [6, 7]
Recursevely sorting range [7, 8]
Recursevely sorting range [1, 9]
Recursevely sorting range [1, 8]
Recursevely sorting range [1, 7]
Recursevely sorting range [1, 6]
Recursevely sorting range [1, 5]
Recursevely sorting range [1, 4]
Recursevely sorting range [1, 3]
Recursevely sorting range [1, 2]
Recursevely sorting range [2, 3]
Recursevely sorting range [2, 4]
Recursevely sorting range [2, 3]
Recursevely sorting range [3, 4]
Recursevely sorting range [2, 5]
Recursevely sorting range [2, 4]
Recursevely sorting range [2, 3]
Recursevely sorting range [3, 4]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [2, 6]
Recursevely sorting range [2, 5]
Recursevely sorting range [2, 4]
Recursevely sorting range [2, 3]
Recursevely sorting range [3, 4]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [3, 6]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [2, 7]
Recursevely sorting range [2, 6]
Recursevely sorting range [2, 5]
Recursevely sorting range [2, 4]
Recursevely sorting range [2, 3]
Recursevely sorting range [3, 4]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [3, 6]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [3, 7]
Recursevely sorting range [3, 6]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [4, 7]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [5, 7]
Recursevely sorting range [5, 6]
Recursevely sorting range [6, 7]
Recursevely sorting range [2, 8]
Recursevely sorting range [2, 7]
Recursevely sorting range [2, 6]
Recursevely sorting range [2, 5]
Recursevely sorting range [2, 4]
Recursevely sorting range [2, 3]
Recursevely sorting range [3, 4]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [3, 6]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [3, 7]
Recursevely sorting range [3, 6]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [4, 7]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [5, 7]
Recursevely sorting range [5, 6]
Recursevely sorting range [6, 7]
Recursevely sorting range [3, 8]
Recursevely sorting range [3, 7]
Recursevely sorting range [3, 6]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [4, 7]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [5, 7]
Recursevely sorting range [5, 6]
Recursevely sorting range [6, 7]
Recursevely sorting range [4, 8]
Recursevely sorting range [4, 7]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [5, 7]
Recursevely sorting range [5, 6]
Recursevely sorting range [6, 7]
Recursevely sorting range [5, 8]
Recursevely sorting range [5, 7]
Recursevely sorting range [5, 6]
Recursevely sorting range [6, 7]
Recursevely sorting range [6, 8]
Recursevely sorting range [6, 7]
Recursevely sorting range [7, 8]
Recursevely sorting range [2, 9]
Recursevely sorting range [2, 8]
Recursevely sorting range [2, 7]
Recursevely sorting range [2, 6]
Recursevely sorting range [2, 5]
Recursevely sorting range [2, 4]
Recursevely sorting range [2, 3]
Recursevely sorting range [3, 4]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [3, 6]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [3, 7]
Recursevely sorting range [3, 6]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [4, 7]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [5, 7]
Recursevely sorting range [5, 6]
Recursevely sorting range [6, 7]
Recursevely sorting range [3, 8]
Recursevely sorting range [3, 7]
Recursevely sorting range [3, 6]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [4, 7]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [5, 7]
Recursevely sorting range [5, 6]
Recursevely sorting range [6, 7]
Recursevely sorting range [4, 8]
Recursevely sorting range [4, 7]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [5, 7]
Recursevely sorting range [5, 6]
Recursevely sorting range [6, 7]
Recursevely sorting range [5, 8]
Recursevely sorting range [5, 7]
Recursevely sorting range [5, 6]
Recursevely sorting range [6, 7]
Recursevely sorting range [6, 8]
Recursevely sorting range [6, 7]
Recursevely sorting range [7, 8]
Recursevely sorting range [3, 9]
Recursevely sorting range [3, 8]
Recursevely sorting range [3, 7]
Recursevely sorting range [3, 6]
Recursevely sorting range [3, 5]
Recursevely sorting range [3, 4]
Recursevely sorting range [4, 5]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [4, 7]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [5, 7]
Recursevely sorting range [5, 6]
Recursevely sorting range [6, 7]
Recursevely sorting range [4, 8]
Recursevely sorting range [4, 7]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [5, 7]
Recursevely sorting range [5, 6]
Recursevely sorting range [6, 7]
Recursevely sorting range [5, 8]
Recursevely sorting range [5, 7]
Recursevely sorting range [5, 6]
Recursevely sorting range [6, 7]
Recursevely sorting range [6, 8]
Recursevely sorting range [6, 7]
Recursevely sorting range [7, 8]
Recursevely sorting range [4, 9]
Recursevely sorting range [4, 8]
Recursevely sorting range [4, 7]
Recursevely sorting range [4, 6]
Recursevely sorting range [4, 5]
Recursevely sorting range [5, 6]
Recursevely sorting range [5, 7]
Recursevely sorting range [5, 6]
Recursevely sorting range [6, 7]
Recursevely sorting range [5, 8]
Recursevely sorting range [5, 7]
Recursevely sorting range [5, 6]
Recursevely sorting range [6, 7]
Recursevely sorting range [6, 8]
Recursevely sorting range [6, 7]
Recursevely sorting range [7, 8]
Recursevely sorting range [5, 9]
Recursevely sorting range [5, 8]
Recursevely sorting range [5, 7]
Recursevely sorting range [5, 6]
Recursevely sorting range [6, 7]
Recursevely sorting range [6, 8]
Recursevely sorting range [6, 7]
Recursevely sorting range [7, 8]
Recursevely sorting range [6, 9]
Recursevely sorting range [6, 8]
Recursevely sorting range [6, 7]
Recursevely sorting range [7, 8]
Recursevely sorting range [7, 9]
Recursevely sorting range [7, 8]
Recursevely sorting range [8, 9]
#+end_example
